# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np 
import pandas as pd
import warnings
warnings.filterwarnings('ignore')  # para quitar warnings

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [2]:
# Run this code:
salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

In [3]:
salaries.columns=[i.replace(' ','')for i in salaries.columns]

Examine the `salaries` dataset using the `head` function below.

In [4]:
# Your code here:
salaries.head()

,Name,JobTitles,Department,FullorPart-Time,SalaryorHourly,TypicalHours,AnnualSalary,HourlyRate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [5]:
# Your code here:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             33183 non-null  object
 1   JobTitles        33183 non-null  object
 2   Department       33183 non-null  object
 3   FullorPart-Time  33183 non-null  object
 4   SalaryorHourly   33183 non-null  object
 5   TypicalHours     8022 non-null   float64
 6   AnnualSalary     25161 non-null  float64
 7   HourlyRate       8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [6]:
# Your code here:
salaries['SalaryorHourly'].value_counts()

Salary    25161
Hourly     8022
Name: SalaryorHourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [7]:
# Your code here:
salaries['Department'].value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [8]:
# Your code here:
salaries[salaries['SalaryorHourly']=='Hourly'].describe()

       TypicalHours  AnnualSalary   HourlyRate
count   8022.000000           0.0  8022.000000
mean      34.507604           NaN    32.788558
std        9.252077           NaN    12.112573
min       10.000000           NaN     2.650000
25%       20.000000           NaN    21.200000
50%       40.000000           NaN    35.600000
75%       40.000000           NaN    40.200000
max       40.000000           NaN   109.000000

In [9]:
# a manita
from scipy.stats import t
mu=30   # media poblacional

mu_hat=salaries[salaries['SalaryorHourly']=='Hourly'].HourlyRate.mean() # media muestral, media del estudio

std_hat=salaries[salaries['SalaryorHourly']=='Hourly'].HourlyRate.std()  # std muestra, std del estudio

n=salaries[salaries['SalaryorHourly']=='Hourly'].HourlyRate.count()    # tamaño de la muestra
mu, mu_hat, std_hat, n

(30, 32.78855771628128, 12.11257268427681, 8022)

In [10]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))
t_test

20.619805785501907

In [11]:
dof=n-1  # grados de libertad

dof

8021

In [12]:
p_value=(t(df=dof).cdf(t_test)/2)

p_value

0.5

In [13]:
#Se acepta la hipótesis nula

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [14]:
# Your code here:
salary=salaries[salaries['SalaryorHourly']=='Salary']
police=salary[salary['Department']=='POLICE']
police.describe()

       TypicalHours   AnnualSalary  HourlyRate
count           0.0   13404.000000         0.0
mean            NaN   86486.414503         NaN
std             NaN   18272.228294         NaN
min             NaN   38376.000000         NaN
25%             NaN   84054.000000         NaN
50%             NaN   90024.000000         NaN
75%             NaN   94524.000000         NaN
max             NaN  260004.000000         NaN

In [15]:
mu=86000   # media poblacional

mu_hat=police.AnnualSalary.mean() # media muestral, media del estudio

std_hat=police.AnnualSalary.std()  # std muestra, std del estudio

n=police.AnnualSalary.count()   # tamaño de la muestra
mu, mu_hat, std_hat, n

(86000, 86486.41450313339, 18272.228293992157, 13404)

In [16]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))
t_test

3.08199700571315

In [17]:
dof=n-1  # grados de libertad

dof

13403

In [18]:
p_value=(t(df=dof).cdf(t_test))

1-p_value

0.0010301701775476957

In [19]:
#Se rechaza la hipotesis nula

Using the `crosstab` function, find the department that has the most hourly workers.

In [20]:
# Your code here:
pd.crosstab(salaries['Department'], salaries['SalaryorHourly']).sort_values('Hourly',ascending=False).head(1)

SalaryorHourly  Hourly  Salary
Department
STREETS & SAN     1862     336

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [21]:
# Your code here:
salaries[salaries['Department']=='STREETS & SAN'].describe()

       TypicalHours   AnnualSalary   HourlyRate
count   1862.000000     336.000000  1862.000000
mean      37.137487   83019.250000    33.728378
std        8.777897   21254.991182     5.735242
min       10.000000   31872.000000    19.500000
25%       40.000000   70056.000000    35.600000
50%       40.000000   84168.000000    35.600000
75%       40.000000   97740.000000    36.210000
max       40.000000  154428.000000    53.100000

In [22]:
mu=35   # media poblacional

mu_hat=salaries[salaries['Department']=='STREETS & SAN'].HourlyRate.mean() # media muestral, media del estudio

std_hat=salaries[salaries['Department']=='STREETS & SAN'].HourlyRate.std()  # std muestra, std del estudio

n=salaries[salaries['Department']=='STREETS & SAN'].HourlyRate.count()  # tamaño de la muestra
mu, mu_hat, std_hat, n

(35, 33.728378088076845, 5.735241841459193, 1862)

In [23]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))
t_test

-9.567447887851964

In [24]:
dof=n-1  # grados de libertad

dof

1861

In [25]:
p_value=(t(df=dof).cdf(t_test))

p_value

1.6689265281767388e-21

In [26]:
#Se acepta la hipótesis nula

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [33]:
# Your code here:
salaries[salaries['SalaryorHourly']=='Hourly'].describe()

       TypicalHours  AnnualSalary   HourlyRate
count   8022.000000           0.0  8022.000000
mean      34.507604           NaN    32.788558
std        9.252077           NaN    12.112573
min       10.000000           NaN     2.650000
25%       20.000000           NaN    21.200000
50%       40.000000           NaN    35.600000
75%       40.000000           NaN    40.200000
max       40.000000           NaN   109.000000

In [34]:
from scipy.stats import t
import matplotlib.pyplot as plt

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [36]:
# Your code here:
salaries[salaries['Department']=='POLICE'].AnnualSalary.describe()

count     13404.000000
mean      86486.414503
std       18272.228294
min       38376.000000
25%       84054.000000
50%       90024.000000
75%       94524.000000
max      260004.000000
Name: AnnualSalary, dtype: float64

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [29]:
# Your code here: